keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCpu_reg.h
/** \\brief  C024, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C024u)

/** \\brief  C028, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C028u)

/** \\brief  C02C, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C02Cu)

/** \\brief  C030, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C030u)

/** \\brief  C034, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C034u)

/** \\brief  C038, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C038u)

/** \\brief  C03C, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C03Cu)

/** \\brief  C040, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C040u)

/** \\brief  C044, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C044u)

/** \\brief  C048, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C048u)

/** \\brief  C04C, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C04Cu)

/** \\brief  E010, CPU Data Protection Read Enable Register Set */
#define CPU1_DPRE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF883E010u)

/** Alias (User Manual Name) for CPU1_DPRE0.
* To use register names with standard convension, please use CPU1_DPRE0.
*/
#define	CPU1_DPRE_0	(CPU1_DPRE0)

/** \\brief  E014, CPU Data Protection Read Enable Register Set */
#define CPU1_DPRE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF883E014u)

/** Alias (User Manual Name) for CPU1_DPRE1.
* To use register names with standard convension, please use CPU1_DPRE1.
*/
#define	CPU1_DPRE_1	(CPU1_DPRE1)

/** \\brief  E018, CPU Data Protection Read Enable Register Set */
#define CPU1_DPRE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF883E018u)

/** Alias (User Manual Name) for CPU1_DPRE2.
* To use register names with standard convension, please use CPU1_DPRE2.
*/
#define	CPU1_DPRE_2	(CPU1_DPRE2)

/** \\brief  E01C, CPU Data Protection Read Enable Register Set */
#define CPU1_DPRE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF883E01Cu)

/** Alias (User Manual Name) for CPU1_DPRE3.
* To use register names with standard convension, please use CPU1_DPRE3.
*/
#define	CPU1_DPRE_3	(CPU1_DPRE3)

/** \\brief  E020, CPU Data Protection Write Enable Register Set */
#define CPU1_DPWE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF883E020u)

/** Alias (User Manual Name) for CPU1_DPWE0.
* To use register names with standard convension, please use CPU1_DPWE0.
*/
#define	CPU1_DPWE_0	(CPU1_DPWE0)

/** \\brief  E024, CPU Data Protection Write Enable Register Set */
#define CPU1_DPWE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF883E024u)

/** Alias (User Manual Name) for CPU1_DPWE1.
* To use register names with standard convension, please use CPU1_DPWE1.
*/
#define	CPU1_DPWE_1	(CPU1_DPWE1)

/** \\brief  E028, CPU Data Protection Write Enable Register Set */
#define CPU1_DPWE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF883E028u)

/** Alias (User Manual Name) for CPU1_DPWE2.
* To use register names with standard convension, please use CPU1_DPWE2.
*/
#define	CPU1_DPWE_2	(CPU1_DPWE2)

/** \\brief  E02C, CPU Data Protection Write Enable Register Set */
#define CPU1_DPWE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF883E02Cu)

/** Alias (User Manual Name) for CPU1_DPWE3.
* To use register names with standard convension, please use CPU1_DPWE3.
*/
#define	CPU1_DPWE_3	(CPU1_DPWE3)

/** \\brief  9010, Data Synchronous Trap Register */
#define CPU1_DSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_DSTR*)0xF8839010u)

/** \\brief  FD08, External Event Register */
#define CPU1_EXEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_EXEVT*)0xF883FD08u)

/** \\brief  FE38, Free CSA List Head Pointer */
#define CPU1_FCX /*lint --e(923)*/ (*(volatile Ifx_CPU_FCX*)0xF883FE38u)

/** \\brief  A000, CPU Trap Control Register */
#define CPU1_FPU_TRAP_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF883A000u)

/** \\brief  A008, CPU Trapping Instruction Opcode Register */
#define CPU1_FPU_TRAP_OPC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF883A008u)

/** \\brief  A004, CPU Trapping Instruction Program Counter Register */
#define CPU1_FPU_TRAP_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF883A004u)

/** \\brief  A010, CPU Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF883A010u)

/** \\brief  A014, CPU Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF883A014u)

/** \\brief  A018, Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF883A018u)

/** \\brief  FC08, Instruction Count */
#define CPU1_ICNT /*lint --e(923)*/ (*(volatile Ifx_CPU_ICNT*)0xF883FC08u)

/** \\brief  FE2C, Interrupt Control Register */
#define CPU1_ICR /*lint --e(923)*/ (*(volatile Ifx_CPU_ICR*)0xF883FE2Cu)

/** \\brief  FE28, Interrupt Stack Pointer */
#define CPU1_ISP /*lint --e(923)*/ (*(volatile Ifx_CPU_ISP*)0xF883FE28u)

/** \\brief  FE3C, Free CSA List Limit Pointer */
#define CPU1_LCX /*lint --e(923)*/ (*(volatile Ifx_CPU_LCX*)0xF883FE3Cu)

/** \\brief  FC0C, Multi-Count Register 1 */
#define CPU1_M1CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M1CNT*)0xF883FC0Cu)

