keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCpu_reg.h
/** \\brief  C064, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR12_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C064u)

/** \\brief  C068, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR13_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C068u)

/** \\brief  C06C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR13_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C06Cu)

/** \\brief  C070, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR14_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C070u)

/** \\brief  C074, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR14_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C074u)

/** \\brief  C078, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR15_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C078u)

/** \\brief  C07C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR15_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C07Cu)

/** \\brief  C008, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C008u)

/** \\brief  C00C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C00Cu)

/** \\brief  C010, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C010u)

/** \\brief  C014, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C014u)

/** \\brief  C018, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C018u)

/** \\brief  C01C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C01Cu)

/** \\brief  C020, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C020u)

/** \\brief  C024, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C024u)

/** \\brief  C028, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C028u)

/** \\brief  C02C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C02Cu)

/** \\brief  C030, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C030u)

/** \\brief  C034, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C034u)

/** \\brief  C038, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C038u)

/** \\brief  C03C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C03Cu)

/** \\brief  C040, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C040u)

/** \\brief  C044, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C044u)

/** \\brief  C048, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C048u)

/** \\brief  C04C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C04Cu)

/** \\brief  E010, CPU Data Protection Read Enable Register Set */
#define CPU2_DPRE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E010u)

/** Alias (User Manual Name) for CPU2_DPRE0.
* To use register names with standard convension, please use CPU2_DPRE0.
*/
#define	CPU2_DPRE_0	(CPU2_DPRE0)

/** \\brief  E014, CPU Data Protection Read Enable Register Set */
#define CPU2_DPRE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E014u)

/** Alias (User Manual Name) for CPU2_DPRE1.
* To use register names with standard convension, please use CPU2_DPRE1.
*/
#define	CPU2_DPRE_1	(CPU2_DPRE1)

/** \\brief  E018, CPU Data Protection Read Enable Register Set */
#define CPU2_DPRE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E018u)

/** Alias (User Manual Name) for CPU2_DPRE2.
* To use register names with standard convension, please use CPU2_DPRE2.
*/
#define	CPU2_DPRE_2	(CPU2_DPRE2)

/** \\brief  E01C, CPU Data Protection Read Enable Register Set */
#define CPU2_DPRE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E01Cu)

/** Alias (User Manual Name) for CPU2_DPRE3.
* To use register names with standard convension, please use CPU2_DPRE3.
*/
#define	CPU2_DPRE_3	(CPU2_DPRE3)

/** \\brief  E020, CPU Data Protection Write Enable Register Set */
#define CPU2_DPWE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E020u)

/** Alias (User Manual Name) for CPU2_DPWE0.
* To use register names with standard convension, please use CPU2_DPWE0.
*/
#define	CPU2_DPWE_0	(CPU2_DPWE0)

/** \\brief  E024, CPU Data Protection Write Enable Register Set */
#define CPU2_DPWE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E024u)

/** Alias (User Manual Name) for CPU2_DPWE1.
* To use register names with standard convension, please use CPU2_DPWE1.
*/
#define	CPU2_DPWE_1	(CPU2_DPWE1)

/** \\brief  E028, CPU Data Protection Write Enable Register Set */
#define CPU2_DPWE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E028u)

/** Alias (User Manual Name) for CPU2_DPWE2.
* To use register names with standard convension, please use CPU2_DPWE2.
*/
#define	CPU2_DPWE_2	(CPU2_DPWE2)

/** \\brief  E02C, CPU Data Protection Write Enable Register Set */
#define CPU2_DPWE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E02Cu)

/** Alias (User Manual Name) for CPU2_DPWE3.
* To use register names with standard convension, please use CPU2_DPWE3.
*/
#define	CPU2_DPWE_3	(CPU2_DPWE3)

/** \\brief  9010, Data Synchronous Trap Register */
#define CPU2_DSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_DSTR*)0xF8859010u)

/** \\brief  FD08, External Event Register */
#define CPU2_EXEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_EXEVT*)0xF885FD08u)

/** \\brief  FE38, Free CSA List Head Pointer */
#define CPU2_FCX /*lint --e(923)*/ (*(volatile Ifx_CPU_FCX*)0xF885FE38u)

/** \\brief  A000, CPU Trap Control Register */
#define CPU2_FPU_TRAP_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF885A000u)

/** \\brief  A008, CPU Trapping Instruction Opcode Register */
#define CPU2_FPU_TRAP_OPC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF885A008u)

/** \\brief  A004, CPU Trapping Instruction Program Counter Register */
#define CPU2_FPU_TRAP_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF885A004u)

/** \\brief  A010, CPU Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF885A010u)

