keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCpu_reg.h
/** \\brief  A014, CPU Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF885A014u)

/** \\brief  A018, Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF885A018u)

/** \\brief  FC08, Instruction Count */
#define CPU2_ICNT /*lint --e(923)*/ (*(volatile Ifx_CPU_ICNT*)0xF885FC08u)

/** \\brief  FE2C, Interrupt Control Register */
#define CPU2_ICR /*lint --e(923)*/ (*(volatile Ifx_CPU_ICR*)0xF885FE2Cu)

/** \\brief  FE28, Interrupt Stack Pointer */
#define CPU2_ISP /*lint --e(923)*/ (*(volatile Ifx_CPU_ISP*)0xF885FE28u)

/** \\brief  FE3C, Free CSA List Limit Pointer */
#define CPU2_LCX /*lint --e(923)*/ (*(volatile Ifx_CPU_LCX*)0xF885FE3Cu)

/** \\brief  FC0C, Multi-Count Register 1 */
#define CPU2_M1CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M1CNT*)0xF885FC0Cu)

/** \\brief  FC10, Multi-Count Register 2 */
#define CPU2_M2CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M2CNT*)0xF885FC10u)

/** \\brief  FC14, Multi-Count Register 3 */
#define CPU2_M3CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M3CNT*)0xF885FC14u)

/** \\brief  FE08, Program Counter */
#define CPU2_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_PC*)0xF885FE08u)

/** \\brief  920C, Program Control 0 */
#define CPU2_PCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON0*)0xF885920Cu)

/** \\brief  9204, Program Control 1 */
#define CPU2_PCON1 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON1*)0xF8859204u)

/** \\brief  9208, Program Control 2 */
#define CPU2_PCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON2*)0xF8859208u)

/** \\brief  FE00, Previous Context Information Register */
#define CPU2_PCXI /*lint --e(923)*/ (*(volatile Ifx_CPU_PCXI*)0xF885FE00u)

/** \\brief  9210, Program Integrity Error Address Register */
#define CPU2_PIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_PIEAR*)0xF8859210u)

/** \\brief  9214, Program Integrity Error Trap Register */
#define CPU2_PIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_PIETR*)0xF8859214u)

/** \\brief  8100, Data Access CacheabilityRegister */
#define CPU2_PMA0 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA0*)0xF8858100u)

/** \\brief  8104, Code Access CacheabilityRegister */
#define CPU2_PMA1 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA1*)0xF8858104u)

/** \\brief  8108, Peripheral Space Identifier register */
#define CPU2_PMA2 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA2*)0xF8858108u)

/** \\brief  9200, Program Synchronous Trap Register */
#define CPU2_PSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_PSTR*)0xF8859200u)

/** \\brief  FE04, Program Status Word */
#define CPU2_PSW /*lint --e(923)*/ (*(volatile Ifx_CPU_PSW*)0xF885FE04u)

/** \\brief  1030, SRI Error Generation Register */
#define CPU2_SEGEN /*lint --e(923)*/ (*(volatile Ifx_CPU_SEGEN*)0xF8851030u)

/** \\brief  900C, SIST Mode Access Control Register */
#define CPU2_SMACON /*lint --e(923)*/ (*(volatile Ifx_CPU_SMACON*)0xF885900Cu)

/** \\brief  FD10, Software Debug Event */
#define CPU2_SWEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_SWEVT*)0xF885FD10u)

/** \\brief  FE14, System Configuration Register */
#define CPU2_SYSCON /*lint --e(923)*/ (*(volatile Ifx_CPU_SYSCON*)0xF885FE14u)

/** \\brief  8004, CPU Task Address Space Identifier Register */
#define CPU2_TASK_ASI /*lint --e(923)*/ (*(volatile Ifx_CPU_TASK_ASI*)0xF8858004u)

/** \\brief  E400, CPU Temporal Protection System Control Register */
#define CPU2_TPS_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_CON*)0xF885E400u)

/** \\brief  E404, CPU Temporal Protection System Timer Register */
#define CPU2_TPS_TIMER0 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E404u)

/** \\brief  E408, CPU Temporal Protection System Timer Register */
#define CPU2_TPS_TIMER1 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E408u)

/** \\brief  E40C, CPU Temporal Protection System Timer Register */
#define CPU2_TPS_TIMER2 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E40Cu)

/** \\brief  F004, Trigger Address */
#define CPU2_TR0_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F004u)

/** Alias (User Manual Name) for CPU2_TR0_ADR.
* To use register names with standard convension, please use CPU2_TR0_ADR.
*/
#define	CPU2_TR0ADR	(CPU2_TR0_ADR)

/** \\brief  F000, Trigger Event */
#define CPU2_TR0_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F000u)

/** Alias (User Manual Name) for CPU2_TR0_EVT.
* To use register names with standard convension, please use CPU2_TR0_EVT.
*/
#define	CPU2_TR0EVT	(CPU2_TR0_EVT)

/** \\brief  F00C, Trigger Address */
#define CPU2_TR1_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F00Cu)

/** Alias (User Manual Name) for CPU2_TR1_ADR.
* To use register names with standard convension, please use CPU2_TR1_ADR.
*/
#define	CPU2_TR1ADR	(CPU2_TR1_ADR)

/** \\brief  F008, Trigger Event */
#define CPU2_TR1_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F008u)

/** Alias (User Manual Name) for CPU2_TR1_EVT.
* To use register names with standard convension, please use CPU2_TR1_EVT.
*/
#define	CPU2_TR1EVT	(CPU2_TR1_EVT)

/** \\brief  F014, Trigger Address */
#define CPU2_TR2_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F014u)

/** Alias (User Manual Name) for CPU2_TR2_ADR.
* To use register names with standard convension, please use CPU2_TR2_ADR.
*/
#define	CPU2_TR2ADR	(CPU2_TR2_ADR)

/** \\brief  F010, Trigger Event */
#define CPU2_TR2_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F010u)

/** Alias (User Manual Name) for CPU2_TR2_EVT.
* To use register names with standard convension, please use CPU2_TR2_EVT.
*/
#define	CPU2_TR2EVT	(CPU2_TR2_EVT)

/** \\brief  F01C, Trigger Address */
#define CPU2_TR3_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F01Cu)

/** Alias (User Manual Name) for CPU2_TR3_ADR.
* To use register names with standard convension, please use CPU2_TR3_ADR.
*/
#define	CPU2_TR3ADR	(CPU2_TR3_ADR)

/** \\brief  F018, Trigger Event */
#define CPU2_TR3_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F018u)

