keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCpu_reg.h
/** Alias (User Manual Name) for CPU2_SPROT_RGN1_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN1_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB1	(CPU2_SPROT_RGN1_ACCENB)

/** \\brief  E010, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E010u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN1_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN1_LA.
*/
#define	CPU2_SPROT_RGNLA1	(CPU2_SPROT_RGN1_LA)

/** \\brief  E014, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E014u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN1_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN1_UA.
*/
#define	CPU2_SPROT_RGNUA1	(CPU2_SPROT_RGN1_UA)

/** \\brief  E028, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN2_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E028u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN2_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN2_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA2	(CPU2_SPROT_RGN2_ACCENA)

/** \\brief  E02C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN2_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E02Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN2_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN2_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB2	(CPU2_SPROT_RGN2_ACCENB)

/** \\brief  E020, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E020u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN2_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN2_LA.
*/
#define	CPU2_SPROT_RGNLA2	(CPU2_SPROT_RGN2_LA)

/** \\brief  E024, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E024u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN2_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN2_UA.
*/
#define	CPU2_SPROT_RGNUA2	(CPU2_SPROT_RGN2_UA)

/** \\brief  E038, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN3_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E038u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN3_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN3_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA3	(CPU2_SPROT_RGN3_ACCENA)

/** \\brief  E03C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN3_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E03Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN3_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN3_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB3	(CPU2_SPROT_RGN3_ACCENB)

/** \\brief  E030, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E030u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN3_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN3_LA.
*/
#define	CPU2_SPROT_RGNLA3	(CPU2_SPROT_RGN3_LA)

/** \\brief  E034, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E034u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN3_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN3_UA.
*/
#define	CPU2_SPROT_RGNUA3	(CPU2_SPROT_RGN3_UA)

/** \\brief  E048, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN4_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E048u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN4_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN4_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA4	(CPU2_SPROT_RGN4_ACCENA)

/** \\brief  E04C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN4_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E04Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN4_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN4_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB4	(CPU2_SPROT_RGN4_ACCENB)

/** \\brief  E040, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E040u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN4_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN4_LA.
*/
#define	CPU2_SPROT_RGNLA4	(CPU2_SPROT_RGN4_LA)

/** \\brief  E044, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E044u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN4_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN4_UA.
*/
#define	CPU2_SPROT_RGNUA4	(CPU2_SPROT_RGN4_UA)

/** \\brief  E058, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN5_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E058u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN5_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN5_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA5	(CPU2_SPROT_RGN5_ACCENA)

/** \\brief  E05C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN5_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E05Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN5_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN5_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB5	(CPU2_SPROT_RGN5_ACCENB)

